In [3]:
import pandas as pd
exam=pd.read_csv('exam.csv')

In [8]:
exam.query('nclass in [1,2,3]')

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32

In [9]:
n1=exam.query('nclass == 1')
n2=exam.query('nclass == 2')
n3=exam.query('nclass == 3')
n4=exam.query('nclass == 4')
n5=exam.query('nclass == 5')

In [10]:
n1['math'].mean()

46.25

In [11]:
var=3

In [12]:
exam.query('nclass == @var')

    id  nclass  math  english  science
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32

In [13]:
df = pd.DataFrame({'sex' : ['F', 'M', 'F', 'M'],
                   'country' : ['Korea', 'China', 'Japan', 'USA']})
df

  sex country
0   F   Korea
1   M   China
2   F   Japan
3   M     USA

In [14]:
df.query('sex == "F"')

  sex country
0   F   Korea
2   F   Japan

In [15]:
df.query('sex == "M"')

  sex country
1   M   China
3   M     USA

In [16]:
import pandas as pd

In [19]:
mpg=pd.read_csv('mpg.csv')

In [20]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234 entries, 0 to 233
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  category      234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 20.2+ KB

In [21]:
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [22]:
mpg_a=mpg.query('displ <= 4')

In [23]:
mpg_b=mpg.query('displ >= 5')

In [25]:
mpg_a['hwy'].mean()

25.96319018404908

In [26]:
mpg_b['hwy'].mean()

18.07894736842105

In [29]:
mpg['manufacturer'].value_counts()

manufacturer
dodge         37
toyota        34
volkswagen    27
ford          25
chevrolet     19
audi          18
hyundai       14
subaru        14
nissan        13
honda          9
jeep           8
pontiac        5
land rover     4
mercury        4
lincoln        3
Name: count, dtype: int64

In [33]:
mpg_audi=mpg.query('manufacturer == "audi"')

In [34]:
mpg_toyota=mpg.query('manufacturer == "toyota"')

In [35]:
mpg_audi['cty'].mean()

17.61111111111111

In [36]:
mpg_toyota['cty'].mean()

18.529411764705884

In [38]:
mpg_3 = mpg.query("manufacturer in ['chevrolet', 'ford', 'honda']")

In [39]:
mpg_3['hwy'].mean()

22.50943396226415

In [40]:
mpg[['hwy']]

     hwy
0     29
1     29
2     31
3     30
4     26
..   ...
229   28
230   29
231   26
232   26
233   26

[234 rows x 1 columns]

In [46]:
exam.drop(columns = ['id','nclass'])

    math  english  science
0     50       98       50
1     60       97       60
2     45       86       78
3     30       98       58
4     25       80       65
5     50       89       98
6     80       90       45
7     90       78       25
8     20       98       15
9     50       98       45
10    65       65       65
11    45       85       32
12    46       98       65
13    48       87       12
14    75       56       78
15    58       98       65
16    65       68       98
17    80       78       90
18    89       68       87
19    78       83       58

In [48]:
exam.query('nclass == 1')[['english']]

   english
0       98
1       97
2       86
3       98

In [50]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 234 entries, 0 to 233
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  category      234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 20.2+ KB

In [52]:
mpg[['category','cty']].head()

  category  cty
0  compact   18
1  compact   21
2  compact   20
3  compact   21
4  compact   16

In [57]:
mpg.query("category =='suv'")['cty'].mean()

13.5

In [58]:
mpg.query("category =='compact'")['cty'].mean()

20.127659574468087

In [64]:
exam.sort_values(['nclass', 'math'],ascending=[True, False])

    id  nclass  math  english  science
1    2       1    60       97       60
0    1       1    50       98       50
2    3       1    45       86       78
3    4       1    30       98       58
7    8       2    90       78       25
6    7       2    80       90       45
5    6       2    50       89       98
4    5       2    25       80       65
10  11       3    65       65       65
9   10       3    50       98       45
11  12       3    45       85       32
8    9       3    20       98       15
14  15       4    75       56       78
15  16       4    58       98       65
13  14       4    48       87       12
12  13       4    46       98       65
18  19       5    89       68       87
17  18       5    80       78       90
19  20       5    78       83       58
16  17       5    65       68       98

In [73]:
mpg.query('manufacturer == "audi"').sort_values('hwy', ascending = False).head(5)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
9,audi,a4 quattro,2.0,2008,4,manual(m6),4,20,28,p,compact

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().